## WORLD QUERY

In [1]:
import mysql.connector

In [2]:
db = mysql.connector.connect( #crate the connection
    user="alcadis",
    password="mypass",
    host="localhost",
)

In [3]:
dbc = db.cursor()

In [4]:
%load_ext sql 
%env DATABASE_URL=mysql+mysqlconnector://alcadis:mypass@localhost

env: DATABASE_URL=mysql+mysqlconnector://alcadis:mypass@localhost

In [5]:
%%sql
CREATE DATABASE IF NOT EXISTS world;

1 rows affected.

[]

In [6]:
%%sql
USE world;
SHOW TABLES;

 * mysql+mysqlconnector://alcadis:***@localhost
0 rows affected.
3 rows affected.

[('city',), ('country',), ('countrylanguage',)]

### 0: Descriviamo le tabelle

In [7]:
%%sql
DESCRIBE city;

 * mysql+mysqlconnector://alcadis:***@localhost
5 rows affected.

[('ID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Name', 'char(35)', 'NO', '', '', ''),
 ('CountryCode', 'char(3)', 'NO', 'MUL', '', ''),
 ('District', 'char(20)', 'NO', '', '', ''),
 ('Population', 'int', 'NO', '', '0', '')]

In [8]:
%%sql
DESCRIBE country;

 * mysql+mysqlconnector://alcadis:***@localhost
15 rows affected.

[('Code', 'char(3)', 'NO', 'PRI', '', ''),
 ('Name', 'char(52)', 'NO', '', '', ''),
 ('Continent', "enum('Asia','Europe','North America','Africa','Oceania','Antarctica','South America')", 'NO', '', 'Asia', ''),
 ('Region', 'char(26)', 'NO', '', '', ''),
 ('SurfaceArea', 'decimal(10,2)', 'NO', '', '0.00', ''),
 ('IndepYear', 'smallint', 'YES', '', None, ''),
 ('Population', 'int', 'NO', '', '0', ''),
 ('LifeExpectancy', 'decimal(3,1)', 'YES', '', None, ''),
 ('GNP', 'decimal(10,2)', 'YES', '', None, ''),
 ('GNPOld', 'decimal(10,2)', 'YES', '', None, ''),
 ('LocalName', 'char(45)', 'NO', '', '', ''),
 ('GovernmentForm', 'char(45)', 'NO', '', '', ''),
 ('HeadOfState', 'char(60)', 'YES', '', None, ''),
 ('Capital', 'int', 'YES', '', None, ''),
 ('Code2', 'char(2)', 'NO', '', '', '')]

In [9]:
%%sql
DESCRIBE countrylanguage;

 * mysql+mysqlconnector://alcadis:***@localhost
4 rows affected.

[('CountryCode', 'char(3)', 'NO', 'PRI', '', ''),
 ('Language', 'char(30)', 'NO', 'PRI', '', ''),
 ('IsOfficial', "enum('T','F')", 'NO', '', 'F', ''),
 ('Percentage', 'decimal(4,1)', 'NO', '', '0.0', '')]

### 1: Which country has the largest population?

In [10]:
%%sql
SELECT Name, Population
FROM country
ORDER BY Population DESC
LIMIT 1;

 * mysql+mysqlconnector://alcadis:***@localhost
1 rows affected.

[('China', 1277558000)]

### 2: Get the total number of cities in Canada

In [11]:
%%sql
SELECT COUNT(Name)
FROM city
WHERE CountryCode = "CAN";

 * mysql+mysqlconnector://alcadis:***@localhost
1 rows affected.

[(49,)]

### 3: Select the country with the most cities

In [12]:
%%sql
SELECT CountryCode, COUNT(Name) AS nCities
FROM city
GROUP BY CountryCode
ORDER BY nCities DESC
LIMIT 1;

 * mysql+mysqlconnector://alcadis:***@localhost
1 rows affected.

[('CHN', 363)]

### 4: List all the languages spoken in the Southeast Asia region.

In [13]:
%%sql
SELECT DISTINCT countrylanguage.Language
FROM country, countrylanguage
WHERE country.Region = "Southeast Asia"
AND countrylanguage.CountryCode = country.Code
ORDER BY countrylanguage.Language ASC;

 * mysql+mysqlconnector://alcadis:***@localhost
47 rows affected.

[('Bali',),
 ('Banja',),
 ('Batakki',),
 ('Bicol',),
 ('Bugi',),
 ('Burmese',),
 ('Cebuano',),
 ('Chin',),
 ('Chinese',),
 ('Dusun',),
 ('English',),
 ('Hiligaynon',),
 ('Iban',),
 ('Ilocano',),
 ('Javanese',),
 ('Kachin',),
 ('Karen',),
 ('Kayah',),
 ('Khmer',),
 ('Kuy',),
 ('Lao',),
 ('Lao-Soung',),
 ('Madura',),
 ('Maguindanao',),
 ('Malay',),
 ('Malay-English',),
 ('Man',),
 ('Maranao',),
 ('Miao',),
 ('Minangkabau',),
 ('Mon',),
 ('Mon-khmer',),
 ('Muong',),
 ('Nung',),
 ('Pampango',),
 ('Pangasinan',),
 ('Pilipino',),
 ('Portuguese',),
 ('Rakhine',),
 ('Shan',),
 ('Sunda',),
 ('Tamil',),
 ('Thai',),
 ('Tho',),
 ('Tšam',),
 ('Vietnamese',),
 ('Waray-waray',)]

### 5 - Identify the 5 most spoken languages by number of countries.

In [14]:
%%sql
#voglio prendere le 5 lingue più parlate al mondo (guardo quanti paesi parlano una lingua)
SELECT Language, COUNT(Language) AS Count
FROM countrylanguage
GROUP BY Language
ORDER BY Count DESC
LIMIT 5;

 * mysql+mysqlconnector://alcadis:***@localhost
5 rows affected.

[('English', 60),
 ('Arabic', 33),
 ('Spanish', 28),
 ('French', 25),
 ('German', 19)]

### 6 - What is the total population of the cities in the Caribbean region?

In [15]:
%%sql
SELECT SUM(city.Population) AS TotalPopulation
FROM city, country
WHERE country.Region = "Caribbean"
AND country.Code = city.CountryCode;

 * mysql+mysqlconnector://alcadis:***@localhost
1 rows affected.

[(Decimal('11067550'),)]

### 7 - What Countries have a City named "Kingston"?

In [24]:
%%sql
SELECT country.Name
FROM country
JOIN city ON city.CountryCode = country.Code
WHERE city.Name = "Kingston"
ORDER BY country.Name ASC;

 * mysql+mysqlconnector://alcadis:***@localhost
2 rows affected.

[('Jamaica',), ('Norfolk Island',)]

### 8 - Plot the population density by country, limiting to the 25 with the least density.